/*
    1. Создать отдельный файл, где необходимо распарсить файл со звонками по учрежденям, из которых совершались звонки.
    2. Создать квитанцию, где надо выставить счёт за звонки совершённые во временном промежутке с 20.00 до 7.00.
*/

public class Main {
    public static void main(String[] args) {

//        try {
//
//            //Scanner scanner = new Scanner(System.in);
//            System.out.println("Введите путь и имя файла со звонками в формате C:\\\\Users\\\\Username\\\\Desktop\\\\230000ххххххх.csv");
//            System.out.println("Введите путь и имя файла с привязкой номеров к учрежденям в формате C:\\\\Users\\\\Username\\\\Desktop\\\\edu.csv");
//
//            printer.printToFile(callsSort.parsingCalls(calls, edu));
//            //scanner.close();
//        } catch (FileException e) {
//            System.err.println(e.getStr());
//        }

    }
}